function App() {
  return(
    <div>   
      <h1>Hello</h1>
      <p>NPM - npm არის როგორ საცავი პაკეტებისთვის JavaScript-ში</p>
      <p>vite - vite არის სწრაფი ფრონტენდ ბილდერი რომელიც გამოიყენება თანამედროვე ვებ აპლიკაციების შესაქმნელად</p>
      <hr />
      <ul>
        <li>node_modules - შეიცავს ბიბლიოთეკებს და პაკეტებს რომლებიც პროექტში გამოიყენება</li>
        <li>src - შეიცავს წყაროს კოდს და კომპონენტებს რომლებიც პროექტში გამოიყენება</li>
        <li>App.jsx - აპლიკაციის მთავარი React კომპონენტი</li>
        <li>main.jsx - React აპლიკაციის შესასვლელი წერტილი</li>
        <li>.gitignore - სია, რომელი ფაილები არ უნდა აიტვირთოს</li>
        <li>package.json - შეიცავს პროექტის მეტამონაცემებს და დამოკიდებულებებს</li>
        <li>vite.config.js - წესების ფაილი Vite-ისთვის</li>
        <li>index.html - გამოიყენება ვებსიტზე ინფორმაციის გამოსაყენებლად</li>
      </ul>
    </div>
  )
}

export default App
