<<<<<<< HEAD
#პითონში lists არის  სტრუქტურა, რომელიც საშუალებას გვაძლევს ერთ ცვლადში შევინახოთ მრავალი ელემენტი
#სინტაქსი პითონში სიის შექმნა ხდება ფიგურების ([]) გამოყენებით, ხოლო ელემენტები გამოყოფილია მძიმით (,)
#ინდექსირება სიის ელემენტებზე წვდომის მეთოდია. პითონი იყენებს ნულიდან (0) დაწყებულ ინდექსებს, რაც ნიშნავს, რომ პირველი ელემენტი 0 ინდექსზეა, მეორე 1 ინდექსზე და ასე შემდეგ.

=======
#პითონში lists არის  სტრუქტურა, რომელიც საშუალებას გვაძლევს ერთ ცვლადში შევინახოთ მრავალი ელემენტი
#სინტაქსი პითონში სიის შექმნა ხდება ფიგურების ([]) გამოყენებით, ხოლო ელემენტები გამოყოფილია მძიმით (,)
#ინდექსირება სიის ელემენტებზე წვდომის მეთოდია. პითონი იყენებს ნულიდან (0) დაწყებულ ინდექსებს, რაც ნიშნავს, რომ პირველი ელემენტი 0 ინდექსზეა, მეორე 1 ინდექსზე და ასე შემდეგ.

>>>>>>> 142c6cee86a4cd45b1d21ddad0427e46a779b378
