function H2() {
    return (
        <>
            <h1>Homework 2</h1>
            <p>Context - კონტექსტი არის გზა, რომ მონაცემები გადავიტანოთ მრავალ კომპონენტში</p>
            <p>Provider - კონტექსტის ნაწილი, რომელიც განსაზღვრავს საიდან მოდის მონაცემი და სად შეიძლება მათი წვდომა.</p>
            <p>Consumer -არის კომპონენტი, რომელიც მიღებს მონაცემებს კონტექსტიდან.</p>
            <p>Wrapper - კომპონენტი, რომელიც გადააცემს მონაცემებს კონტექსტიდან.</p>
        </>
    );
}

export default H2;  