<<<<<<< HEAD
# 3) Control Flow-ს სამი კომპონენტი:
# - **Sequence (მიმდევრობა)**: კოდი სრულდება ზედა ხაზიდან ქვემოთ, თანმიმდევრობით.
# - **Selection (არჩევა)**: კოდი შეიცავს პირობას (if-else), რომლის მიხედვითაც სხვადასხვა გზით სრულდება.
# - **Iteration (იტერაცია)**: კოდი იმეორებს გარკვეულ ბლოკს (for, while ციკლები).
=======
# 3) Control Flow-ს სამი კომპონენტი:
# - **Sequence (მიმდევრობა)**: კოდი სრულდება ზედა ხაზიდან ქვემოთ, თანმიმდევრობით.
# - **Selection (არჩევა)**: კოდი შეიცავს პირობას (if-else), რომლის მიხედვითაც სხვადასხვა გზით სრულდება.
# - **Iteration (იტერაცია)**: კოდი იმეორებს გარკვეულ ბლოკს (for, while ციკლები).
>>>>>>> 142c6cee86a4cd45b1d21ddad0427e46a779b378
